
const quizData = {
  "קצין/נה": {
    popupText: "קצין יקר, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80,  בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מהו תו התקן?",
        answers: ["רשיון כשיר להכשיר", "מסמך המייצר אחידות בתהליכי הדרכה", "מסמך שמרכז את המענה הפיקודי", "מסמך המרכז את הנהלים למענה פיקודי בהכשרה"],
        correct: 1
      },
      {
        q: "מהו שעון ההדרכה והאם רלוונטי לקצין המדור?",
        answers: ["רשימת מופעי הדרכה מדוריים בחלוקה לשבועות-רלוונטי לקצין קורס ורמד", "לוז ממג המכיל את מופעי המגמה-רלוונטי לרמת הרמד ומעלה", "רשימת עוגנים שבועיים בתקופת ההדרכה- רלוונטי לכל רמות הפיקוד", "לוז ענפי עם מופעי ההדרכה המשמש את הממג לבניית לוז מגמה- רלוונטי לרמת הממג"],
        correct: 2
      },
      {
        q: "איזה ידע נדרש לנהל בקמפוס הדיגיטלי- בחר את כל התשובות הנכונות",
        answers: ["תיעוד מלא של נתוני החניך בהכשרה לרבות מבחנים, משובים ודפי הדרכה", "ניהול מאגרי תוכן", "ראיונות ושיחות אישיות", "תיעוד סטטוס סיום קורס של החניך וציון סופי", "לוז הכשרה ספיציפי"],
         correct: [0,1,3]
      },
      {
        q: "מה מהתכנים הבאים אינו מטרה של תקופת ההתארגנות?",
        answers: ["עדכון ושיפור הרמה המקצועית", "גיבוש המדורים ויצירת הווי לצוותי העבודה", "הסדרת תהליכי כניסה לתפקיד של בעלי מקצוע חדשים", "יצירת שפה משותפת ונהלים לתקופה הקרובה"],
        correct: 2
      },
      {
        q: "תומר קצינה בענף כבר כשלושה חודשים ופיקדה על מספר הכשרות במדור. בתקופת ההתארגנות נעדרה למספר ימים עקב אירוע משפחתי והפסידה את סדנת החניכה והתלב, בוחן דפדוף לנוהל הוצאת אימון והמבחן המקצועי. כיצד יש לנהוג",
        answers: ["תומר לא תוכל לפתוח קורסים בתקופת ההדרכה-הרמד ימלא את מקומה", "תומר נדרשת להשלים את בוחן הדפדוף להוצאת אימון משום שכבר מכירה את החומר המקצועי ונהלי התלב", "יש להשלים את כל התוכן שהפסידה ולוודא כי משלימה את המבחנים טרם תחילת תקופת ההדרכה", "יש להשלים רק את המבחן המקצועי ובוחן הדפדוף, אחריותה האישית להשלים את סדנת החניכה"],
        correct: 2
      },
      {
        q: "כחלק מניהול המידע ההדרכתי- יש לשמור ולתייק מסמכים שונים הקשורים להכשרות. סמן את המבחן המיותר",
        answers: ["סיכומי קורס קצר+ ארוך.", "סיכום ישיבת פתיחת שבוע מדורית", "תיק אישי וחוזה חניכה למדריכה", "דוח סיכום תפקיד"],
        correct: 1
      },
      {
        q: "במה מותנה מועד ג' לחניך בהכרשה?",
        answers: ["מותנה בשיחת מפקד ישיר", "מותנה בשיחה עם רען", "מותנה בשיחה עם ק. צפה", "מותנה בשיחה עם הממג"],
        correct: 3
      },
      {
        q: "מהו מצב מבחן?",
        answers: ["תרגיל אינטגרטיבי הכולל מספר מטלות עם הקשר ותרחיש", "כלי המשקף רמת כשירות החניך בכל אחד ממרכיבי תפקידיו בסוף ההכשרה", "תרגיל מרכזי בהכשרה אשר מתרגל את החניך בביצוע משימה על כל שלביה", "כלי למדידה או תהליך הנועד לבחון בתחום מסוים"],
        correct: 2
      },
      {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכרשה?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכרשה?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "תיק המדריך מכיך גם מעקבים על נוכחות החניכים?",
        answers: ["לא נכון", "נכון"],
        correct: 0
      },
       {
        q: "תיקוף תיק המדריך יהיה כשהשתנה התול / שיטת הלימוד",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "מהו עץ הערכה?",
        answers: ["כלי המאגד את רשימת הכשירויות בהכשרות.", "כלי המסביר על כל סוגי המבחנים וההתנסויות הנערכים לחניכים בהכשרה", " כלי המשקף את רמת הכשירות של החניכים בכל מרכיבי התפקיד אליו הם מוסמכים", "כלי באמצעותו ממשב המפקד את חניכיו בהתנסויות והמבחנים השונים"
        ],
        correct: 1
      },
      {
        q: "מהו יחס המבחנים בהכשרה בין מעשי לעיוני?",
        answers: ["30% עיוניים 70% מעשיים", "20% עיונים 80% מעשיים", "80% מעשיים 20% עיוניים", "70% מעשיים 30% עיוניים"],
        correct: 0
      },
      {
        q: "מהו תיק החניכה למדריכה ומה הוא מכיל?",
        answers: ["תיק המהווה את חוזה החניכה עם המדריכה ומלווה אותה. מכיל יעדים אישיים,חוזקות וחולשות, תבנית החניכה, חוודים ומשובים.", "מהווה את כל המידע על המדריכה, מכיל את הראיונות והמשובים שעוברת המדריכה בשירותה", "התיק המסייע למדריכה לחנוך למשב את הקורסים שלה, מכיל פורמטי מישוב לשיעורים, מבחנים מעשיים וחוודים לחניכים.", "מסייע למדריכה להעביר את התכנים בהכשרות. מכיל את מארזי ההדרכה, רצף ההכשרה ומופעים אותם עתידה למשב"],
        correct: 0
      },
      {
        q: "מהם מופעי החניכה המינימאליים שהנך מחוייב לבצע למדריכות תחתיך?",
        answers: ["לכל הפחות ארבעה מופעי חניכה בתקופת ההדרכה, לפחות אחד מהם על העברת שיעור", "לכל הפחות שני מופעי חניכה וחווד סוף", "לכל הפחות מופע חניכה אחד על העברת תרגיל", "לכל הפחות מופע חניכה בתקופה של ארבעה חודשים וחווד תקופתי בתקופה של ארבעה חודשים"],
        correct: 3
      },
      {
        q: "מה נכון להגיד על חניכת הקצינים בענף?",
        answers: ["חניכת הקצינים זהה לחניכת המדריכות", "חניכת הקצינים מתבצעת בשלושה חודשים הראשונים שלהם בתפקיד", "חניכת הקצינים מתבצעת על ידי פ.ע חניכה אחת לתקופת הדרכה/ארבעה חודשים בו המפקד מוריד משוב הדרכתי וחווד מקצועי", "לקצינים אין תיק חניכה קשיח והוא נמצא בקמפוס הדיגיטלי"],
        correct: 2
      },
      {
        q: "חניכת מדריכה חדשה במדור לתפקיד היא?",
        answers: ["חניכה לתפקיד", "חניכה לביצוע"],
        correct: 0
      },
       {
        q: "חניכה להעברת שיעור מנגנון מקלרון היא?",
        answers: ["חניכה לתפקיד", "חניכה לביצוע"],
        correct: 1
      },
       {
        q: "חניכה לתפעול בסיסי של איתן היא?",
        answers: ["חניכה לתפקיד", "חניכה לביצוע"],
        correct: 1
      },
       {
        q: "חניכה בקמד המקצועי היא?",
        answers: ["חניכה לתפקיד", "חניכה לביצוע"],
        correct: 0
      },
       {
        q: "מהו רשיון להדריך ותוך כמה זמן צריך להתבצע?",
        answers: ["מסמך המווה גאנט חניכה של בעל התפקיד הנכנס על ידי היוצא ומכיל את התוכן המקצועי במדור- תוך חודש מכניסה לתפקיד", "רשימת נהלי התלב והמענה הפיקודי לקצין בענף על פי תיק ההנחיות הענפי- בשבוע הראשון בענף", "מסמך המכיל את התכנים המחייבים בכניסה לתפקיד של כל בעלי התפקידים בענף, מהווה אישור הדרכתי ומקצועי- צריך להתבצע תוך חודשיים", "תעודה שמקבל כל קצין בענף שמסלמת כי אינו קצין חדש יותר- ותה מקבל אחרי שלושה חודשים בענף"
        ],
        correct: 2
      },
       {
        q: "מהו תהליך סיום התפקיד למדריכה במקרה של פער בביצוע בתפקיד?",
        answers: ["דיווח לרמד->וועדת רען->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תכנית חניכה->וועדת רען->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תוכנית חניכה->וועדת רען-> וועדת מחט"],
        correct: 3
      },
       {
        q: "חניכה על החניכה הינו מופע בו מפקד חונך את המפקדים תחתיו על האופן בו מתבצע החניכה אילו מבין הקריטריונים יש להעריך במסגרת חניכה זו? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע של התדריך של החונך לנחנך טרם המופע, מיקום החונך בזמן תצפית", "נקודות ההתערבות שהחונך מבצע בזמן תצפית, אופן תיעוד התצפית", "איתור התופעות הרלוונטיות, שימוש בדף הערכה, אופן העברת המשוב והתמודדות עם התנגדויות החניך", "כל התשובות נכונות"],
        correct: [3]
      },
      {
        q: "חניך מתקשה הינו חניך שמאותר אצלו פער בעמידה בהישגים הנדרשים בהכשרה ונדרש לבנות לו תוכנית אישית. סמן מה לא צריך שהתוכנית תכלול",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח קצר", "הגדרת השיבוץ החזוי לחניך"],
        correct: 3
      },
      {
        q: "מה דרכי הפעולה העומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונת",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח", "התאמות במבחנים-לדוגמא הארכות זמן,הקראות, מבחן בעל פה", "הצמדת חונך מקצועי- לדומגא משק עברית"],
        correct: [0,2,3]
      },
      {
        q: "מה מהבאים מהווה קריטריון לבחירת חניך מצטיין קורס? סמן את כל התשובות הנכונות",
        answers: ["ציונים גבוהים וציון סופי מעל 80", "ציוני משובים להתנסויות מעל 85", "סוציומטרי עמיתים גבוה", "נוכחות מלאה בהכשרה ללא העדרות מופעים"],
        correct: [0,2]
      },
      {
        q: "בסיום הקמד חיר מתבצעת העברת מקל למדורים השונים- כיצד תתבצע העברת המקל?",
        answers: ["שליחת הנתונים האישיים וגליון הציונים ליחידה הקולטת ושיח טלפוני אודות החיילת", "שיחה פרונטלית בה מועבר דוח נתונים מלא על החייל/ת כולל גליון ציונים וכלל התיק האישי", "העברת הנתונים האישיים והתיק אישי במייל, שיח טלפוני במקרה של אירועים חריגים", "שליחת כלל הנתונים על החייל/ת במייל ושיח פרונטלי על התפקוד בקמד"],
        correct: 1
      },
    ]
  },

  "משה\"ד/ית": {
    popupText: "משהד/ית יקר/ה, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80,  בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מהו מצב מבחן?",
        answers: ["תרגיל אינטגרטיבי הכולל מספר מטלות עם הקשר ותרחיש", "כלי המשקף רמת כשירות החניך בכל אחד ממרכיבי תפקידיו בסוף ההכשרה", "תרגיל מרכזי בהכשרה אשר מתרגל את החניך בביצוע משימה על כל שלביה", "כלי למדידה או תהליך הנועד לבחון בתחום מסוים"],
        correct: 2
      },
      {
        q: "מהו יחס המבחנים בהכשרה בין מעשי לעיוני?",
        answers: ["30% עיוניים 70% מעשיים", "20% עיונים 80% מעשיים", "80% מעשיים 20% עיוניים", "70% מעשיים 30% עיוניים"],
        correct: 0
      },
      {
        q: "במה מותנה מועד ג' לחניך בהכרשה?",
        answers: ["מותנה בשיחת מפקד ישיר", "מותנה בשיחה עם רען", "מותנה בשיחה עם ק. צפה", "מותנה בשיחה עם הממג"],
        correct: 3
      },
      {
        q: "חניך בקורס נכשל בשלושה מבחנים, מה יש עלינו לעשות?",
        answers: ["להעיף אותו מהקורס", "לתת לו לעשות עוד מבחן", "לתת לו להבחן עם חומר פתוח", "לפתוח לו נוהל חניך מתקשה"],
        correct: 3
      },
      {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה, בוחן כשג מעשי, בוחן קליעה מעשי (אפשר להחריג באישור רען) ובוחן תו תקן עיוני", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "יניב הוא קצין קורס במדור נמר שעתיד לפתוח קורס בתקופת ההדרכה הקרובה. הוא ידוע כמפקד טוב ואחראי, במהלך תקופת ההתארגנות יניב נעדר מתכנים מחייבים של הכנת הסגל והפסיד את בוחן הכשג והבוחן המקצועי. כיצד יש לנהוג?",
        answers: ["יניב לא יכול לפתוח את המחזור- יש לפנות לרען על מנת למצוא מפקד מחליף.", "יניב נדרש להשלים את בוחן הכשג בלבד, השלמת הבוחן המקצועי אינה חובה","יש להשלים ליניב את כל המבחנים שאינו ביצע ולוודא שמשלים את התוכן המקצועי שהפסיד","נדרש לבצע ליניב את המבחנים כתנאי לפתיחת המחזור, השלמת המבחנים הינה אחריות אישית שלו ובזמנו הפנוי"],
        correct: 2
      },
      {
        q: "מהם מופעי החניכה המינימאליים שהנך מחוייב לעבור על ידי מפקדך הישיר?",
        answers: ["לכל הפחות ארבעה מופעי חניכה במחזור, אחד מהם לפחות הינו על העברת שיעור", "לכל הפחות שני מופעי חניכה כאשר אחד מהם לפחות הוא על חניכה על חניכה", "לפחות מופע אחד","אף תשובה אינה נכונה"],
        correct: 1
      },
      {
        q: "מה מאפיין את תוכנית החניכה לאיש סגל? סמן את כל התשובות הנכונות",
        answers: ["מתעדכנת אחת למחזור", "רלוונטית לכל מרכיבי התפקיד- מקצועי, הדרכתי, פיקודי וערכי","לא חשופה לאיש הסגל- רק למפקדיו","נבנית בהתאם לחוזקות ולחולשות של איש הסגל","רלוונטית למשהד בלבד"],
        correct: [0,1,3]
      },
      {
        q: "מהו תהליך סיום התפקיד למדריכה במקרה של פער בביצוע בתפקיד?",
        answers: ["דיווח לרמד->וועדת רען->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תכנית חניכה->וועדת רען->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תוכנית חניכה->וועדת רען-> וועדת מחט"],
        correct: 3
      },
      {
        q: "חניכה על החניכה הינו מופע בו מפקד חונך את המפקדים תחתיו על האופן בו מתבצע החניכה אילו מבין הקריטריונים יש להעריך במסגרת חניכה ז? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע של התדריך של החונך לנחנך טרם המופע, מיקום החונך בזמן תצפית", "נקודות ההתערבות שהחונך מבצע בזמן תצפית, אופן תיעוד התצפית", "איתור התופעות הרלוונטיות, שימוש בדף הערכה, אופן העברת המשוב והתמודדות עם התנגדויות החניך", "כל התשובות נכונות"
        ],
        correct: [3]
      },
      {
        q: "חניך מתקשה הינו חניך שמאותר אצלו פער בעמידה בהישגים הנדרשים בהכרשה ונדרש לבנות לו תוכנית אישית. סמן מה לא צריך שהתוכנית תכלול",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח קצר", "הגדרת השיבוץ החזוי לחניך"],
        correct: 3
      },
      {
        q: "מה דרכי הפעולה העומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונת",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח", "התאמות במבחנים-לדוגמא הארכות זמן,הקראות, מבחן בעל פה", "הצמדת חונך מקצועי- לדומגא משק עברית"],
        correct: [0,2,3]
      },
        {
        q: "אילו תכנים מופיעים בתיק האישי לחניכה בקמד המקצועי? סמן את כל התשובות הנכונות",
        answers: ["ראיונות אישיים", "נוכחות בשיעורים", "סיכומי משובים", "חווד אמצע וסוף"],
        correct: [0,2,3]
      },
        {
        q: "מהם הנושאים שיש להעביר כחלק ממסמך העברת מקל?",
        answers: ["פרטים אישיים של החניך", "מידע מקצועי- הישיגים, נקודות חוזקה/חולשה", "התיחסות החניך למידע הנאמר עליו בהעברת מקל", "מידע אודות נורמות וערכי החניך"],
        correct: [0,1,3]
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי רען בלבד?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "החניך יהיה מודע למידע המועבר עליו טרם ביצוע העברת המקל",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות להמשך בקשר לחניך?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
    ]
  },

  "קה\"ד/ית": {
    popupText: "קהד/ית יקר/ה, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80 , בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מהו מצב מבחן?",
        answers: ["תרגיל אינטגרטיבי הכולל מספר מטלות עם הקשר ותרחיש", "כלי המשקף רמת כשירות החניך בכל אחד ממרכיבי תפקידיו בסוף ההכשרה", "תרגיל מרכזי בהכשרה אשר מתרגל את החניך בביצוע משימה על כל שלביה", "כלי למדידה או תהליך הנועד לבחון בתחום מסוים"],
        correct: 2
      },
      {
        q: "מהו יחס המבחנים בהכשרה בין מעשי לעיוני?",
        answers: ["30% עיוניים 70% מעשיים", "20% עיונים 80% מעשיים", "80% מעשיים 20% עיוניים", "70% מעשיים 30% עיוניים"],
        correct: 0
      },
      {
        q: "במה מותנה מועד ג' לחניך בהכרשה?",
        answers: ["מותנה בשיחת מפקד ישיר", "מותנה בשיחה עם רען", "מותנה בשיחה עם ק. צפה", "מותנה בשיחה עם הממג"],
        correct: 3
      },
      {
        q: "חניך בקורס נכשל בשלושה מבחנים, מה יש עלינו לעשות?",
        answers: ["להעיף אותו מהקורס", "לתת לו לעשות עוד מבחן", "לתת לו להבחן עם חומר פתוח", "לפתוח לו נוהל חניך מתקשה"],
        correct: 3
      },
      {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה, בוחן כשג מעשי, בוחן קליעה מעשי (אפשר להחריג באישור רען) ובוחן תו תקן עיוני", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "יניב הוא קצין קורס במדור נמר שעתיד לפתוח קורס בתקופת ההדרכה הקרובה. הוא ידוע כמפקד טוב ואחראי, במהלך תקופת ההתארגנות יניב נעדר מתכנים מחייבים של הכנת הסגל והפסיד את בוחן הכשג והבוחן המקצועי. כיצד יש לנהוג?",
        answers: ["יניב לא יכול לפתוח את המחזור- יש לפנות לרען על מנת למצוא מפקד מחליף.", "יניב נדרש להשלים את בוחן הכשג בלבד, השלמת הבוחן המקצועי אינה חובה","יש להשלים ליניב את כל המבחנים שאינו ביצע ולוודא שמשלים את התוכן המקצועי שהפסיד","נדרש לבצע ליניב את המבחנים כתנאי לפתיחת המחזור, השלמת המבחנים הינה אחריות אישית שלו ובזמנו הפנוי"],
        correct: 2
      },
      {
        q: "מהם מופעי החניכה המינימאליים שהנך מחוייב לעבור על ידי מפקדך הישיר?",
        answers: ["לכל הפחות ארבעה מופעי חניכה במחזור, אחד מהם לפחות הינו על העברת שיעור", "לכל הפחות שני מופעי חניכה כאשר אחד מהם לפחות הוא על חניכה על חניכה", "לפחות מופע אחד","אף תשובה אינה נכונה"],
        correct: 1
      },
      {
        q: "מה מאפיין את תוכנית החניכה לאיש סגל? סמן את כל התשובות הנכונות",
        answers: ["מתעדכנת אחת למחזור", "רלוונטית לכל מרכיבי התפקיד- מקצועי, הדרכתי, פיקודי וערכי","לא חשופה לאיש הסגל- רק למפקדיו","נבנית בהתאם לחוזקות ולחולשות של איש הסגל","רלוונטית למשהד בלבד"],
        correct: [0,1,3]
      },
      {
        q: "מהו תהליך סיום התפקיד למדריכה במקרה של פער בביצוע בתפקיד?",
        answers: ["דיווח לרמד->וועדת רען->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תכנית חניכה->וועדת רען->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תוכנית חניכה->וועדת רען-> וועדת מחט"],
        correct: 3
      },
      {
        q: "חניכה על החניכה הינו מופע בו מפקד חונך את המפקדים תחתיו על האופן בו מתבצע החניכה אילו מבין הקריטריונים יש להעריך במסגרת חניכה ז? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע של התדריך של החונך לנחנך טרם המופע, מיקום החונך בזמן תצפית", "נקודות ההתערבות שהחונך מבצע בזמן תצפית, אופן תיעוד התצפית", "איתור התופעות הרלוונטיות, שימוש בדף הערכה, אופן העברת המשוב והתמודדות עם התנגדויות החניך", "כל התשובות נכונות"
        ],
        correct: [3]
      },
      {
        q: "חניך מתקשה הינו חניך שמאותר אצלו פער בעמידה בהישגים הנדרשים בהכרשה ונדרש לבנות לו תוכנית אישית. סמן מה לא צריך שהתוכנית תכלול",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח קצר", "הגדרת השיבוץ החזוי לחניך"],
        correct: 3
      },
      {
        q: "מה דרכי הפעולה העומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונת",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח", "התאמות במבחנים-לדוגמא הארכות זמן,הקראות, מבחן בעל פה", "הצמדת חונך מקצועי- לדומגא משק עברית"],
        correct: [0,2,3]
      },
        {
        q: "אילו תכנים מופיעים בתיק האישי לחניכה בקמד המקצועי? סמן את כל התשובות הנכונות",
        answers: ["ראיונות אישיים", "נוכחות בשיעורים", "סיכומי משובים", "חווד אמצע וסוף"],
        correct: [0,2,3]
      },
        {
        q: "מהם הנושאים שיש להעביר כחלק ממסמך העברת מקל?",
        answers: ["פרטים אישיים של החניך", "מידע מקצועי- הישיגים, נקודות חוזקה/חולשה", "התיחסות החניך למידע הנאמר עליו בהעברת מקל", "מידע אודות נורמות וערכי החניך"],
        correct: [0,1,3]
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי רען בלבד?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "החניך יהיה מודע למידע המועבר עליו טרם ביצוע העברת המקל",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות להמשך בקשר לחניך?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
    ]
  },

  "רמ\"ד + ממ\"ג": {
    popupText: "מפקד יקר, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80, בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מי מוביל את ביקורת ההדרכה בענפים?",
        answers: ["גפה", "רען ענף", "מחט"],
        correct: 0
      },
      {
        q: "מי מוביל את אישור התוכניות בתקופת ההתארגנת?",
        answers: ["גפה", "רען ענף", "מחט"],
        correct: 2
      },
      {
        q: "מי מוביל את אישור התוכניות החודשי?",
        answers: ["גפה", "רען ענף", "מחט"],
        correct: 1
      },
      {
        q: "הקמפוס הדיגיטלי היא מערכת העוזרת לקיום בקרה, מעקב ושימור ידע בתחומי ההדרכה השונים. איזה מידע צריך להיות במערכת זו? סמן את כל התשובות הנכונות",
        answers: ["תיק לימוד לחניכים- מבחנים, משובים ודפי הערכה", "לוז הכשרה פרטני", "ניהול מאגרי התוכן בהכשרה", "תיעוד סטטוס סיום קורס של חניך וציון סופי", "ראיונות ושיחות אישיות של חניכי הקורס"],
        correct: [0,2,3]
      },
      {
        q: "מתי יוצגו מטרות וידעים ענפיים לתקופת הדרכה?",
        answers: ["אישור תקופת הדרכה", "סיכום תקופת הדרכה"],
        correct: 0
      },
      {
        q: "מתי יוצג מבנה הענף, תחלופת בעלי תפקידים ופערים בכח אדם?",
        answers: ["אישור תקופת הדרכה", "סיכום תקופת הדרכה"],
        correct: 0
      },
      {
        q: "מתי יוצג מבנה המדורים, עיקרי העשייה בהם וגרף הענף?",
        answers: ["אישור תקופת הדרכה", "סיכום תקופת הדרכה"],
        correct: 0
      },
      {
        q: "מתי יוצג עמידה ביעדי ומטרות הענף ותכנון מול ביצוע?",
        answers: ["אישור תקופת הדרכה", "סיכום תקופת הדרכה"],
        correct: 1
      },
      {
        q: "מי מהבאים אינו מטרה של תקופת ההתארגנות?",
        answers: ["עדכון ושיפור הרמה המקצועית", "גיבוש המדורים ויצירת הווי לצוותי העבודה", "הסדרת תהליכי הכניסה לתפקיד של בעלי תפקידים חדשים","יצירת שפה משותפת ונהלים למהלך התקופה הקרבה"],
        correct: 2
      },
        {
        q: "תומר קצינה בענף כבר כשלושה חודשים ופיקדה על מספר הכשרות במדור. בתקופת ההתארגנות נעדרה למספר ימים עקב אירוע משפחתי והפסידה את סדנת החניכה והתלב, בוחן דפדוף לנוהל הוצאת אימון והמבחן המקצועי. כיצד יש לנהוג?",
        answers: ["תומר לא תוכל לפתוח קורסים בתקופת ההדרכה-הרמד ימלא את מקומה", "תומר נדרשת להשלים את בוחן הדפדוף להוצאת אימון משום שכבר מכירה את החומר המקצועי ונהלי התלב", "יש להשלים את כל התוכן שהפסידה ולוודא כי משלימה את המבחנים טרם תחילת תקופת ההדרכה", "יש להשלים רק את המבחן המקצועי ובוחן הדפדוף, אחריותה האישית להשלים את סדנת החניכה"],
        correct: 2
      },
      {
        q: "כחלק מניהול המידע ההדרכתי- יש לשמור ולתייק מסמכים שונים הקשורים להכשרות, מהו אינו אחד מהמסמכים?",
        answers: ["סיכום קורס קצר/ארוך", "סיכום ישיבת פתיחת שבוע מדורית", "תיק אישי וחוזה חניכה למדריכה","דיווח סיכום תפקיד"],
        correct: 1
      },
       {
        q: "מהו עץ הערכה?",
        answers: ["כלי המאגד את רשימת הכשירויות בהכשרות", "כלי המאגד את כל סוגי המבחנים וההתנסויות הנערכים לחניכים בהכשרה", "כלי המשקף את רמת הכשירויות של החניכים בכל מרכיבי התפקיד אליו הם מוסמכים","כלי באמצעותו ממשב המפקד את חניכיו בהתנסויות ובמבחנים השונים"],
        correct: 2
      },
       {
        q: "מהו מצב מבחן?",
        answers: ["תרגיל אינטגרטיבי הכולל מספר מטלות עם הקשר ותרחיש", "כלי המשקף רמת כשירות החניך בכל אחד ממרכבי תפקידיו בסוף ההכשרה", "תרגיל מרכזי בהכשרה אשר מתרגל את החניך בביצוע משימה על כל שלביה","כלי למדידה או תהליך הנועד לבחון בתחום מסויים"],
        correct: 2
      },
      {
        q: "מהו יחס המבחנים בהכשרה בין מעשי לעיוני?",
        answers: ["30% עיוניים 70% מעשיים", "20% עיונים 80% מעשיים", "80% מעשיים 20% עיוניים", "70% מעשיים 30% עיוניים"],
        correct: 0
      },
       {
        q: "במה מותנה מועד ג' לחניך בהכשרה?",
        answers: ["מותנה בשיחת מפקד ישיר", "מותנה בשיחה עם רען", "מותנה בשיחה עם ק. צפה","מותנה בשיחה עם ממג"],
        correct: 3
      },
      {
        q: "חניך בקורס נכשל ב3 מבחנים, מה לעשות?",
        answers: ["להעיף אותו מהקורס", "לתת לו לעשות עוד מבחן ", "לתת לו להבחן עם חומר פתוח","לפתוח לו נוהל חניך מתקשה"],
        correct: 3
      },
            {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "מהו תיק החניכה למדריכה ומה הוא מכיל?",
        answers: ["תיק המהווה את חוזה החניכה עם המדריכה ומלווה אותה. מכיל יעדים אישיים,חוזקות וחולשות, תבנית החניכה, חוודים ומשובים.", "מהווה את כל המידע על המדריכה,מכיל את הראיונות והמשובים שעוברת המדריכה בשירותה", "תיק המסייע למדריכה לחנוך ולמשב את הקורסים שלה, מכיל פורמטי מישוב לשיעורים ומבחנים מעשיים וחוודים לחניכים.", "מסייע למדריכה להעביר את התכנים בהכשרות. מכיל את מארזי ההדרכה, רצף ההכשרה ומופעים אותם עתידה למשב"],
        correct: 0
      },
      {
        q: "מה נכון להגיד על חניכת הקצינים בענף?",
        answers: ["חניכת הקצינים בענף זהה לחניכת המדריכות", "חניכת הקצינים בענף מתבצעת רק בשלושה חודשים הראשונים שלהם בתפקיד", "חניכת קצינים מתבצעת על ידי פ.ע חניכה אחת לתקופת הדרכה/ארבעה חודשים בה המפקד מוריד משוב הדרכתי וחוות דעת מקצועית","לקצינים אין תיק חניכה קשיח והוא נמצא בקמפוס הדיגיטלי"],
        correct: 2
      },
      {
        q: "מהו רשיון להדריך ותוך כמה זמן צריך להתבצע?",
        answers: ["מסמך המווה גאנט חניכה של בעל התפקיד הנכנס על ידי היוצא ומכיל א התוכן המקצועי במדור- תוך חודש מכניסה לתפקיד", "רשימת נהלי התלב והמענה הפיקודי לקצין בענף על פי תיק ההנחיות הענפי- בשבוע הראשון בענף", "מסמך המכיל את התכנים המחייבים בכניסה לתפקיד של כל בעלי התפקידים בענף, מהווה אישור הדרכתי ומקצועי- צריך להתבצע תוך חודשיים", "תעודה שמקבל כל קצין בענף שמסלמת כי אינו קצין חדש יותר- מתקבלת אחרי שלושה חודשים בענף"
        ],
        correct: 2
      },
      {
        q: "מהו תהליך סיום התפקיד למדריכה במקרה של פער בביצוע בתפקיד?",
        answers: ["דיווח לרמד->וועדת רען->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תכנית חניכה->וועדת רען->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט", "דיווח לרמד->שיחת משוב ובניית תוכנית חניכה->וועדת רען-> וועדת מחט"],
        correct: 3
      },
      {
        q: "חניכה על החניכה הינו מופע בו מפקד חונך את המפקדים תחתיו על האופן בו מתבצע החניכה אילו מבין הקריטריונים יש להעריך במסגרת חניכה זו- סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע של התדריך של החונך לנחנך טרם המופע, מיקום החונך בזמן תצפית", "נקודות ההתערבות שהחונך מבצע בזמן תצפית, אופן תיעוד התצפית", "איתור התופעות הרלוונטיות, שימוש בדף הערכה, אופן העברת המשוב והתמודדות עם התנגדויות החניך", "כל התשובות נכונות"
        ],
        correct: [3]
      },
      {
        q: "מה יכיל גאנט החפיפה לקצין החדש ומה יכיל תיק החפיפה?",
        answers: ["תיק החפיפה יכיל את תכני רישיון להדריך וגאנט החפיפה יציג את מועד העברת התכנים", "גאנט החפיפה יכיל את מופעי רישיון להדריך ומועד ביצועם בעוד התיק יכיל מידע על התפקיד, משימות,ממשקים וכו", "גאנט החפיפה יכיל את תכני הסכלת ומועד ביצועם (שיחות מחייבות, ראיונות פתיחה וכו) תיק החפיפה יכיל את המידע על התפקיד, ממשקי העבודה ודגשים חשובים", "תיק החפיפה יכיל מידע על החטיבה והענף בהקשרי התפקיד, גאנט החפיפה יכיל את הפ.ע המקצועיים והראיונות היכרות המחייבים"],
        correct: 1
      },
      {
        q: "חניך מתקשה הינו חניך שמאותר אצלו פער בעמידה בהישגים הנדרשים בהכרשה ונדרש לבנות לו תוכנית אישית. סמן מה לא צריך שהתוכנית תכלול",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח קצר", "הגדרת השיבוץ החזוי לחניך"],
        correct: 3
      },
      {
        q: "מה דרכי הפעולה העומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונת",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח", "התאמות במבחנים-לדוגמא הארכות זמן,הקראות, מבחן בעל פה", "הצמדת חונך מקצועי- לדומגא משק עברית"],
        correct: [0,2,3]
      },
      {
        q: "מה מהבאים אינו מהווה קריטריון לבחירת חניך מצטיין קורס?",
        answers: ["ללא אירועי משמעת", "ציוני משובים להתנסויות מעל 80", "סוציומטרי עמיתים גבוה", "חווד מפקד בולט לחיוב"],
        correct: 1
      },
      {
        q: "מי מוגדר כמדריכ/ה פוטנציאלי/ת ליציאה לפיקוד בקמד? סמן את כל התשובות הנכונות",
        answers: ["יתרת שירות מספיקה ללפחות 3 מחזורים/מחזור ויציאה לקקצ", "התנסות בתפקיד פיקודי אחד לפחות", "כשירות גופנית וערכית גבוהה", "מגיע מרקע הדרכת חיר בלבד"],
        correct: [0,2]
      },
      {
        q: "בסיום הקמד חיר מתבצעת העברת מקל למדורים השונים, כיצד תתבצע העברת המקל?",
        answers: ["שליחת הנתונים האישיים וגליון הציונים ליחידה הקולטת ושיח טלפוני אודות החייל", "שיחה פרונטלית בה מועבר דוח נתונים מלא על החייל/ת כולל גליון ציונים וכלל התיק האישי", "העברת הנתונים האישיים והתיק האישי במייל ושיח טלפוני במקרה של אירועים חריגים", "שליחת כלל הנתונים על החייל/ת במייל ושיח פרונטלי על תפקרוד החייל/ת בקמד"],
        correct: 1
      },
      {
        q: "אילו תכנים מופיעים בתיק האישי לחניכה בקמד המקצועי? סמן את כל התשובות הנכונות",
        answers: ["ראיונות אישיים", "נוכחות בשיעורים", "סיכומי משובים", "חווד אמצע וסוף"],
        correct: [0,2,3]
      },
      {
        q: "מתי תוצג שלדה פרטנית למהלך הקורס?",
        answers: ["אישור קורס", "סיכום קורס"],
        correct: 0
      },
      {
        q: "מתי יוצג סדכ מתאמנים צפוי?",
        answers: ["אישור קורס", "סיכום קורס"],
        correct: 0
      },
      {
        q: "מתי יוצג סיכום היערכות מקדימה, תכנון מול ביצוע, מיצוי זמן ולקחים?",
        answers: ["אישור קורס", "סיכום קורס"],
        correct: 1
      },
      {
        q: "מתי יוצגו הגורמים המשפיעים?",
        answers: ["אישור קורס", "סיכום קורס"],
        correct: 0
      },
      {
        q: "מתי יוצגו מטרות הקורס וסטטוס העמידה בהם?",
        answers: ["אישור קורס", "סיכום קורס"],
        correct: 1
      },
      {
        q: "מתי יוצג סדכ פתיחה וסיום כולל הדחות ואירועים חריגים?",
        answers: ["אישור קורס", "סיכום קורס"],
        correct: 1
      },
    
    ]
  }
};
const dropdown = document.getElementById("roleDropdown");
setupDropdown("roleDropdown");
setupDropdown("branchDropdown");

function setupDropdown(dropdownId) {

    const dropdown = document.getElementById(dropdownId);

    if (!dropdown) return;

    const selected = dropdown.querySelector(".dropdownSelected");

    const list = dropdown.querySelector(".dropdownList");

    const items = dropdown.querySelectorAll(".dropdownItem");

    selected.onclick = () => {

        list.style.display =
            list.style.display === "block"
            ? "none"
            : "block";
    };

    items.forEach(item => {

        item.onclick = () => {

            selected.innerText = item.innerText;

            list.style.display = "none";
        };
    });

    document.addEventListener("click", (e) => {

        if (!dropdown.contains(e.target)) {

            list.style.display = "none";
        }
    });
}
function submitForm() {

    const role =
        document.querySelector("#roleDropdown .dropdownSelected")
        ?.innerText;

    const branch =
        document.querySelector("#branchDropdown .dropdownSelected")
        ?.innerText;

    if (role === "תפקיד" || branch === "ענף") {

        alert("יש לבחור תפקיד וענף");

        return;
    }

    const userData = {
        role: role.trim(),
        branch: branch.trim(),
        fullName: document.getElementById("fullName").value,
        // personalNumber: document.getElementById("personalNumber").value
    };

    localStorage.setItem(
        "userData",
        JSON.stringify(userData)
    );

    window.location.href = "test.html";
}


let currentIndex = 0;
let score = 0;

function openPopup(text) {
    document.getElementById("popupText").innerText = text;

    document.getElementById("popup").style.display = "block";
    document.getElementById("overlay").style.display = "block";
}

function closePopup() {
    document.getElementById("popup").style.display = "none";
    document.getElementById("overlay").style.display = "none";
}

/* ---------------- QUIZ ---------------- */

const questionText = document.getElementById("questionText");

const answersContainer = document.getElementById("answersContainer");

const currentQuestionSpan = document.getElementById("currentQuestion");

const totalQuestionsSpan = document.getElementById("totalQuestions");

let currentQuestionIndex = 0;

let quizScore = 0;

/* בדיקה שאנחנו באמת ב-test.html */
if (window.location.pathname.includes("test.html")) {

    const userData = JSON.parse(localStorage.getItem("userData"));

    if (userData) {

        const role = userData.role;

        const quiz = quizData[role];

        if (quiz) {

            totalQuestionsSpan.innerText = quiz.questions.length;

            showQuestion();
        }
    }
}

function showQuestion() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    const currentQuestion = quiz.questions[currentQuestionIndex];

    questionText.innerText = currentQuestion.q;

    if (currentQuestion.q.length > 55) {
        questionText.classList.add("smallQuestion");
    } else {
        questionText.classList.remove("smallQuestion");
    }

    currentQuestionSpan.innerText = currentQuestionIndex + 1;

    answersContainer.innerHTML = "";

    const isMultiple = Array.isArray(currentQuestion.correct);

    currentQuestion.answers.forEach((answer, index) => {

        const button = document.createElement("button");

        button.classList.add("answerBtn");

        button.innerText = answer;

        if (isMultiple) {

            button.onclick = () => {
                button.classList.toggle("selected");
            };

        } else {

            button.onclick = () => {
                checkAnswer(index);
            };
        }

        answersContainer.appendChild(button);
    });

    if (isMultiple) {

        const submitBtn = document.createElement("button");

        submitBtn.innerText = "בדיקה";

        submitBtn.classList.add("checkBtn");

        submitBtn.onclick = checkMultipleAnswers;

        answersContainer.appendChild(submitBtn);
    }
}

function checkAnswer(selectedIndex) {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    const currentQuestion = quiz.questions[currentQuestionIndex];

    const allButtons = document.querySelectorAll(".answerBtn");

    allButtons.forEach(button => {
        button.classList.add("disabled");
    });

    /* נכון */
    if (selectedIndex === currentQuestion.correct) {

        allButtons[selectedIndex].classList.add("correct");

        quizScore += 5;
    }

    /* לא נכון */
    else {

        allButtons[selectedIndex].classList.add("wrong");

        allButtons[currentQuestion.correct].classList.add("correct");
    }

    sessionStorage.setItem("quizScore", quizScore);

    /* מעבר אוטומטי לשאלה הבאה */
    setTimeout(() => {

        nextQuestion();

    }, 1500);
}
function nextQuestion() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    currentQuestionIndex++;

    if (currentQuestionIndex >= quiz.questions.length) {

        showFinalPopup();

        return;
    }

    showQuestion();
}

function checkMultipleAnswers() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    const currentQuestion = quiz.questions[currentQuestionIndex];

    const correctAnswers = currentQuestion.correct;

    const allButtons = document.querySelectorAll(".answerBtn");

    let selectedIndexes = [];

    allButtons.forEach((button, index) => {

        if (button.classList.contains("selected")) {
            selectedIndexes.push(index);
        }

        button.classList.add("disabled");
    });

    let isCorrect =
        selectedIndexes.length === correctAnswers.length &&
        selectedIndexes.every(index => correctAnswers.includes(index));

    allButtons.forEach((button, index) => {

        if (correctAnswers.includes(index)) {
            button.classList.add("correct");
        }

        else if (button.classList.contains("selected")) {
            button.classList.add("wrong");
        }
    });

    if (isCorrect) {
        quizScore += 5;
    }

    sessionStorage.setItem("quizScore", quizScore);

    /* מעבר אוטומטי לשאלה הבאה */
    setTimeout(() => {

        nextQuestion();

    }, 1500);
}

function showFinalPopup() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const branch = userData.branch;

    let targetEmail = "";

    switch(branch) {

        case "חשיפה תקיפה":
            targetEmail = "guyleeneuman@gmail.com";
            break;

        case "רק\"ם מתקדם":
            targetEmail = "guyleeneuman@gmail.com";
            break;

        default:
            targetEmail = "guyleeneuman@gmail.com";
    }

    const quiz = quizData[role];

    const totalQuestions = quiz.questions.length;

    const correctAnswersCount = quizScore / 5;

    /* חישוב אחוזים */
    const percent = Math.round(
        (quizScore / (totalQuestions * 5)) * 100
    );

    /* צבע לפי ציון */
    const percentColor =
        percent >= 80
        ? "rgba(3, 90, 16, 1)"
        : "rgba(163, 11, 13, 1)";

    /* הודעת נכשל */
    const failedMessage =
        percent < 80
        ? `<p class="retryText">
                יש לבצע את המבחן פעם נוספת
           </p>`
        : "";

    document.getElementById("overlay").style.display = "block";

    const endPopup = document.createElement("div");

    endPopup.classList.add("popup");

    endPopup.innerHTML = `
    
        <img class="popUpbg" src="assets/elements/endPopUp.png">

        <p class="popUpTextEnd endText">

            ענית נכון על 

            <span>${correctAnswersCount}</span>
            מתוך <span>${totalQuestions}</span>

            <br>

            ציון סופי:

            <span style="color:${percentColor}">
                ${percent}%
            </span>

        </p>

        ${failedMessage}

        <img 
            class="popUpClose"
            src="assets/buttons/toHomeBtn.png"
            onclick="goBackToLearning()"
        >
    `;

    document.body.appendChild(endPopup);

    /* EMAILJS */

    emailjs.send(
        // "service_2ufvwvi",
        // "template_v99t2wf",
        {
            to_email: targetEmail,

            role: role,

            branch: branch,

            full_name: userData.fullName,

            // personal_number: userData.personalNumber,

            score: `${correctAnswersCount}/${totalQuestions}`,

            percent: `${percent}%`
        }
    )
    .then(() => {

        console.log("email sent");

    })
    .catch((error) => {

        console.log("email error", error);
    });
}

/* מעבר חזרה */
function goBackToLearning() {

    window.location.href = "index.html";
}